УчетВУправляющихДляГит1/src/InformationRegisters/ПубликуемыеНавигационныеСсылки/ПубликуемыеНавигационныеСсылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПубликуемыеНавигационныеСсылки</name>
  <resources>
    <name>ИмяФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПараметрыФормы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ХешПараметровФормы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/ПубликуемыеНавигационныеСсылки/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыФормы = ПараметрыФормы();
	ПараметрыФормы.Вставить("КонтекстныйВызов", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		Отказ = Истина;
		ОткрытьФорму(Запись.ИмяФормы, ПараметрыФормы, , , , , , РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПараметрыФормы()
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормыРеквизитов = РегистрыСведений.ПубликуемыеНавигационныеСсылки.ПараметрыПубликации();
	ЗаполнитьЗначенияСвойств(ПараметрыФормыРеквизитов, Запись);
	ДополнитьПараметрыФормы(ПараметрыФормы, ПараметрыФормыРеквизитов);
	
	ДополнительныеПараметрыФормы = ДополнительныеПараметрыФормы();
	Если ЗначениеЗаполнено(ДополнительныеПараметрыФормы)
		И ТипЗнч(ДополнительныеПараметрыФормы) = Тип("Структура") Тогда
		ДополнитьПараметрыФормы(ПараметрыФормы, ДополнительныеПараметрыФормы);
	КонецЕсли;
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаСервере
Функция ДополнительныеПараметрыФормы()
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Идентификатор", Запись.Идентификатор);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПубликуемыеНавигационныеСсылки.ПараметрыФормы КАК ПараметрыФормы
	|ИЗ
	|	РегистрСведений.ПубликуемыеНавигационныеСсылки КАК ПубликуемыеНавигационныеСсылки
	|ГДЕ
	|	ПубликуемыеНавигационныеСсылки.Идентификатор = &Идентификатор";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПараметрыФормы.Получить();
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ДополнитьПараметрыФормы(ПараметрыФормы, СтруктураДополнения)
	
	Для Каждого КлючЗначение Из СтруктураДополнения Цикл
		ДобавитьНепустойПараметрФормы(ПараметрыФормы, КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНепустойПараметрФормы(ПараметрыФормы, Ключ, Значение)
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыФормы.Свойство(Ключ) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы.Вставить(Ключ, Значение);
	
КонецПроцедуры

#КонецОбласти
